[
  {
    "conferenceName": "ACM International Conference on the Foundations of Software Engineering (was ESEC/FSE, changed 2024; duplicate previously listed as ESEC, removed from DB)",
    "conferenceAcronym": "FSE",
    "conferenceIndex": 3,
    "conferenceLink": "https://conf.researchr.org/dates/fse-2025",
    "cfpLink": "https://conf.researchr.org/track/fse-2025/fse-2025-research-papers",
    "impLink": "https://conf.researchr.org/track/fse-2025/fse-2025-research-papers#important-dates",
    "conferenceText": "Conference FSE_3:\nFSE 2025   Mon 23 - Fri 27 June 2025 Trondheim, Norway    \n co-located with ISSTA 2025    \n\n Toggle navigation        \n Attending | Venue: Clarion Hotel Trondheim \n  Diversity and Inclusion Plan \n  Code of Conduct \n  Sponsorship | Sponsorship Opportunities \n  Sponsors and Supporters \n  Tracks | FSE 2025 \n  How to Submit \n  Research Papers \n  Industry Papers \n  Ideas, Visions and Reflections \n  Journal First \n  Student Research Competition \n  Demonstrations \n  Posters \n  Artifacts \n  Doctoral Symposium \n  New Faculty Symposium \n  Software Engineering Education \n  Tutorials \n  Student Volunteers \n  Industry Mentoring Symposium \n  Workshops \n  Open Science Policy \n   Co-hosted Conferences \n  ISSTA \n  Workshops \n  2030 Software Engineering \n  AI IDE \n  AI-SDLC \n  BI4LLMC \n  CauSE \n  DevOpsSustain \n  FaSE4Games \n  HumanAISE \n  Intersectionality@FSE \n  LLMapp \n  LLanMER \n  QSE-NE \n  ResponsibleSE \n  SWGeno \n  Organization | FSE 2025 Committees \n  Organizing Committee \n  Steering Committee \n  Track Committees \n  Research Papers \n  Industry Papers \n  Ideas, Visions and Reflections \n  Journal First \n  Student Research Competition \n  Demonstrations \n  Posters \n  Artifacts \n  Doctoral Symposium \n  New Faculty Symposium \n  Software Engineering Education \n  Tutorials \n  Student Volunteers \n  Industry Mentoring Symposium \n  Workshops \n  Contributors \n  People Index \n   Workshops \n  2030 Software Engineering | Program Committee \n  AI IDE | Organisation Committee \n  Program Committee \n  AI-SDLC | N/A - check homepage \n  BI4LLMC | N/A - check homepage \n  CauSE | N/A - check homepage \n  DevOpsSustain | N/A - check homepage \n  FaSE4Games | N/A - check homepage \n  HumanAISE | N/A - check homepage \n  Intersectionality@FSE | N/A - check homepage \n  LLMapp | N/A - check homepage \n  LLanMER | N/A - check homepage \n  QSE-NE | N/A - check homepage \n  ResponsibleSE | N/A - check homepage \n  SWGeno | N/A - check homepage \n  Search \n  Series | Series \n   FSE 2025 \n  FSE 2024 \n  ESEC/FSE 2023 \n  ESEC/FSE 2022 \n  ESEC/FSE 2021 \n  ESEC/FSE 2020 \n  ESEC/FSE 2018 \n  Sign in \n  Sign up \n\n  FSE 2025  ( series  ) /  Important Dates  \n\n When | Track | What \n Mon 13 Jan 2025 | Demonstrations | Submission deadline \n Tue 14 Jan 2025 | Research Papers | Initial notification \n Wed 15 Jan 2025 | Industry Papers | Submission deadline \n Wed 15 Jan 2025 | Software Engineering Education | Submission deadline \n Thu 16 Jan 2025 | Ideas, Visions and Reflections | Submission deadline \n Mon 3 Feb 2025 | Tutorials | Submission deadline \n Tue 11 Feb 2025 | Research Papers | Camera ready (directly accepted paper) \n Fri 14 Feb 2025 | Student Research Competition | Submission deadline \n Sun 23 Feb 2025 | 2030 Software Engineering | Submission Deadline \n Mon 24 Feb 2025 | Doctoral Symposium | Submission deadline \n Tue 25 Feb 2025 | Research Papers | Submission for major-revision papers \n Fri 28 Feb 2025 | Posters | Submission deadline \n Mon 3 Mar 2025 | Tutorials | Acceptance \n Tue 4 Mar 2025 | Journal First | Submission deadline \n Mon 10 Mar 2025 | Demonstrations | Author notification \n Fri 14 Mar 2025 | Ideas, Visions and Reflections | Author notification \n Mon 24 Mar 2025 | Student Research Competition | Notification \n Tue 25 Mar 2025 | 2030 Software Engineering | Acceptance Deadlines \n Tue 25 Mar 2025 | Software Engineering Education | Author notification \n Tue 25 Mar 2025 | Industry Papers | Author notification \n Sun 30 Mar 2025 | Student Volunteers | Submission deadline \n Tue 1 Apr 2025 | Research Papers | Final notification for major revisions \n Fri 4 Apr 2025 | Journal First | Author notification \n Thu 10 Apr 2025 | Posters | Acceptance notification \n Thu 10 Apr 2025 | Doctoral Symposium | Notification \n Mon 14 Apr 2025 | Tutorials | Camera-ready deadline \n Mon 21 Apr 2025 | Industry Papers | Camera-ready deadline \n Mon 21 Apr 2025 | Software Engineering Education | Camera ready \n Thu 24 Apr 2025 | Ideas, Visions and Reflections | Camera-ready deadline \n Thu 24 Apr 2025 | Posters | Camera-ready deadline \n Thu 24 Apr 2025 | Demonstrations | Camera-ready deadline \n Thu 24 Apr 2025 | Workshops | Camera-ready deadline \n Thu 24 Apr 2025 | Student Research Competition | Camera-ready version \n Thu 24 Apr 2025 | Research Papers | Camera ready (major revisions) \n Thu 24 Apr 2025 | Doctoral Symposium | Camera-ready deadline \n Fri 25 Apr 2025 | Student Volunteers | Notification \n Sat 26 - Sun 27 Jul 2025 | 2030 Software Engineering | Worksop \n Tue 30 Sep 2025 | 2030 Software Engineering | Submission Deadline for the ACM TOSEM special issue \n Fri 31 Oct 2025 | 2030 Software Engineering | Acceptance Notification of ACM TOSEM papers \n Fri 22 - Tue 26 Nov 2024 | Research Papers | Author response \n Tue 19 Nov 2024 | Workshops | Notification \n Tue 15 Oct 2024 | Workshops | Workshop proposals submission \n Thu 12 Sep 2024 | Research Papers | Full paper submission \n Thu 5 Sep 2024 | Research Papers | Paper registration \n\n x  Sat 14 Dec 01:50    \n\n  FSE 2025   \n  contact form    \n  using conf.researchr.org  ( v1.68.0  )  \n   Support page    \n     \n Tracks  \n How to Submit   \n  Research Papers   \n  Industry Papers   \n  Ideas, Visions and Reflections   \n  Journal First   \n  Student Research Competition   \n  Demonstrations   \n  Posters   \n  Artifacts   \n  Doctoral Symposium   \n  New Faculty Symposium   \n  Software Engineering Education   \n  Tutorials   \n  Student Volunteers   \n  Industry Mentoring Symposium   \n  Workshops   \n  Open Science Policy    \n Workshops  \n 2030 Software Engineering 2025   \n  AI IDE 2025   \n  AI-SDLC 2025   \n  BI4LLMC 2025   \n  CauSE 2025   \n  DevOpsSustain 2025   \n  FaSE4Games 2025   \n  HumanAISE 2025   \n  Intersectionality@FSE 2025   \n  LLMapp 2025   \n  LLanMER 2025   \n  QSE-NE 2025   \n  ResponsibleSE 2025   \n  SWGeno 2025    \n\n Attending  \n Venue: Clarion Hotel Trondheim   \n  Diversity and Inclusion Plan   \n  Code of Conduct    \n\n  \nCall for Papers data:\nFSE 2025   Mon 23 - Fri 27 June 2025 Trondheim, Norway    \n co-located with ISSTA 2025    \n\n Toggle navigation        \n Attending | Venue: Clarion Hotel Trondheim \n  Diversity and Inclusion Plan \n  Code of Conduct \n  Sponsorship | Sponsorship Opportunities \n  Sponsors and Supporters \n  Tracks | FSE 2025 \n  How to Submit \n  Research Papers \n  Industry Papers \n  Ideas, Visions and Reflections \n  Journal First \n  Student Research Competition \n  Demonstrations \n  Posters \n  Artifacts \n  Doctoral Symposium \n  New Faculty Symposium \n  Software Engineering Education \n  Tutorials \n  Student Volunteers \n  Industry Mentoring Symposium \n  Workshops \n  Open Science Policy \n   Co-hosted Conferences \n  ISSTA \n  Workshops \n  2030 Software Engineering \n  AI IDE \n  AI-SDLC \n  BI4LLMC \n  CauSE \n  DevOpsSustain \n  FaSE4Games \n  HumanAISE \n  Intersectionality@FSE \n  LLMapp \n  LLanMER \n  QSE-NE \n  ResponsibleSE \n  SWGeno \n  Organization | FSE 2025 Committees \n  Organizing Committee \n  Steering Committee \n  Track Committees \n  Research Papers \n  Industry Papers \n  Ideas, Visions and Reflections \n  Journal First \n  Student Research Competition \n  Demonstrations \n  Posters \n  Artifacts \n  Doctoral Symposium \n  New Faculty Symposium \n  Software Engineering Education \n  Tutorials \n  Student Volunteers \n  Industry Mentoring Symposium \n  Workshops \n  Contributors \n  People Index \n   Workshops \n  2030 Software Engineering | Program Committee \n  AI IDE | Organisation Committee \n  Program Committee \n  AI-SDLC | N/A - check homepage \n  BI4LLMC | N/A - check homepage \n  CauSE | N/A - check homepage \n  DevOpsSustain | N/A - check homepage \n  FaSE4Games | N/A - check homepage \n  HumanAISE | N/A - check homepage \n  Intersectionality@FSE | N/A - check homepage \n  LLMapp | N/A - check homepage \n  LLanMER | N/A - check homepage \n  QSE-NE | N/A - check homepage \n  ResponsibleSE | N/A - check homepage \n  SWGeno | N/A - check homepage \n  Search \n  Series | Series \n   FSE 2025 \n  FSE 2024 \n  ESEC/FSE 2023 \n  ESEC/FSE 2022 \n  ESEC/FSE 2021 \n  ESEC/FSE 2020 \n  ESEC/FSE 2018 \n  Sign in \n  Sign up \n\n  FSE 2025  ( series  ) /  Research Papers FSE 2025   \n   \n Call for Papers \n  FAQ \n  Call for Papers  \n  \n We invite high-quality submissions, from both industry and academia, describing original and unpublished results of theoretical, empirical, conceptual, and experimental software engineering research.  \n Contributions should describe innovative and significant original research. Papers describing groundbreaking approaches to emerging problems are also welcome, as well as replication papers. Submissions that facilitate reproducibility by using available datasets or making the described tools and datasets publicly available are especially encouraged. For a list of specific topics of interest, please see the end of this call.  \n Note #1:  The Proceedings of the ACM on Software Engineering (PACMSE)  Issue FSE 2025 seeks contributions through submissions in this track. Accepted papers will be invited for presentation at FSE 2025. Approval has been granted by ACM in July 2023. PACMSE will be the only proceedings where accepted research track papers will be published. Please check the FAQ  for details.  \n Note #2:  The steering committee has decided that starting from 2024 the conference name will be changed to ACM International Conference on the Foundations of Software Engineering (FSE).  \n Note #3:  Based on the coordination among FSE, ICSE, and ASE steering committees, the FSE conference and submission dates have been moved earlier, similarly to FSE 2024 deadlines. The intention is for this schedule to remain stable in the years ahead and the conference and submission deadlines of the three large general software engineering conferences to be spread out throughout the year.  \n Note #4:  Submissions must follow the “ ACM Policy on Authorship  ” released April 20, 2023, which contains policy regarding the use of Generative AI tools and technologies, such as ChatGPT. Please also check the ACM FAQ  which describes in what situations generative AI tools can be used (with or without acknowledgement).  \n Note #5:  The names and list of authors as well as the title in the camera-ready version cannot be modified from the ones in the submitted version unless there is explicit approval from the track chairs.  \n Note #6:  Submissions that are changing the required submission format to gain additional space will be desk rejected. Examples of changing format include removing the ACM Reference format and the permission to make digital or hard copy footnotes on the first page.  \n Tracks   \n This CFP refers to the Research Track of FSE 2025. For the remaining tracks, please check the specific calls on the website: https://conf.researchr.org/home/fse-2025   \n HOW TO SUBMIT   \n The following only applies to the main track of FSE. For the other tracks please see the general formatting instructions  .   \n At the time of submission, each paper should have no more than 18 pages for all text and figures, plus 4 pages for references, using the following templates: Latex  or Word (Mac)  or Word (Windows)  . Authors using LaTeX should use the sample-acmsmall-conf.tex  file (found in the samples folder of the acmart package) with the acmsmall  option. We also strongly encourage the use of the review, screen, and anonymous options as well. In summary, you want to use: \\documentclass[acmsmall,screen,review,anonymous]{acmart}  . Papers may be submitted using numeric citations, but final versions of accepted papers must use the author-year format for citations. It is a single-column page layout. Submissions that do not comply with the above instructions will be desk rejected without review. Papers must be submitted electronically through the FSE 2025 submission site:  \n https://fse2025.hotcrp.com   \n Each submission will be reviewed by at least three members of the program committee. The review process is that the initial output can be accept, reject or major revision  . When the initial output of the three reviews is major revision, authors will have an opportunity to address the reviewers’ requests during a 6-week  major revision period. Such requests may include additional experiments or new analyses of existing results; major rewriting of algorithms and explanations; clarifications, better scoping, and improved motivations. The revised submission must be accompanied by a response letter  , where the authors explain how they addressed each concern expressed by the reviewers. The same reviewers who requested major revisions will then assess whether the revised submission satisfies their requests adequately.  \n Submissions will be evaluated on the basis of originality, importance of contribution, soundness, evaluation (if relevant), quality of presentation, and appropriate comparison to related work. Some papers may have more than three reviews, as PC chairs may solicit additional reviews based on factors such as reviewer expertise and strong disagreement between reviewers. The program committee as a whole will make final decisions about which submissions to accept for publication.  \n In addition to declaring the topics which are relevant for their submissions, authors will be asked to declare the research methods employed in their submissions. This will enable us to ensure reviewer expertise both for research methods and topics. For full definitions of the research methods, see the SIGSOFT Empirical Standards  .  \n Double-Anonymous Review Process   \n In order to ensure the fairness of the reviewing process, the FSE 2025 Research Papers Track will employ a double-anonymous review process, where reviewers do not know the identity of authors, and authors do not know the identity of external reviewers. The papers submitted must not reveal the authors’ identities in any way:  \n Authors should leave out author names and affiliations from the body of their submission. \n  Authors should ensure that any citation to related work by themselves is written in third person, that is, “the prior work of XYZ” as opposed to “our prior work”. \n  Authors should not include URLs to author-revealing sites (tools, datasets). Authors are still encouraged to follow open science principles and submit replication packages, see more details on the open science policy below. \n  Authors should anonymize author-revealing company names but instead provide general characteristics of the organizations involved needed to understand the context of the paper. \n  Authors should ensure that paper acknowledgements do not reveal the origin of their work. \n  While authors have the right to upload preprints on ArXiV or similar sites, they should avoid specifying that the manuscript was submitted to FSE 2025. \n  During review, authors | should not publicly use the submission title | . \n  The double-anonymous process used this year is “heavy”, i.e., the paper anonymity will be maintained during all reviewing and discussion periods. In case of major revision, authors must therefore maintain anonymity in their response letter and must provide no additional information that could be author-revealing.  \n To facilitate double-anonymous reviewing, we recommend the authors to postpone publishing their submitted work on arXiv or similar sites until after the notification  . If the authors have uploaded to arXiv or similar, they should avoid specifying that the manuscript was submitted to FSE 2025.  \n Authors with further questions on double-anonymous reviewing are encouraged to contact the program chairs by email. Papers that do not comply with the double-anonymous review process will be desk-rejected.  \n Submission Policies   \n The authors must follow the “ACM Policy on Authorship” released April 20, 2023 and its accompanying FAQ including the following points:  \n “Generative AI tools and technologies, such as ChatGPT, may not be listed as authors of an ACM published Work. The use of generative AI tools and technologies to create content is permitted but must be fully disclosed in the Work. For example, the authors could include the following statement in the Acknowledgements section of the Work: ChatGPT was utilized to generate sections of this Work, including text, tables, graphs, code, data, citations, etc.). If you are uncertain about the need to disclose the use of a particular tool, err on the side of caution, and include a disclosure in the acknowledgements section of the Work.” \n  “If you are using generative AI software tools to edit and improve the quality of your existing text in much the same way you would use a typing assistant like Grammarly to improve spelling, grammar, punctuation, clarity, engagement or to use a basic word processing system to correct spelling or grammar, it is not necessary to disclose such usage of these tools in your Work.” \n  Please read the full policy and FAQ.  \n Papers submitted for consideration to FSE should not have been already published elsewhere and should not be under review or submitted for review elsewhere during the reviewing period. Specifically, authors are required to adhere to the ACM Policy and Procedures on Plagiarism  and the ACM Policy on Prior Publication and Simultaneous Submissions  .  \n To prevent double submissions, the chairs might compare the submissions with related conferences that have overlapping review periods. The double submission restriction applies only to refereed journals and conferences, not to unrefereed forums (e.g. arXiv.org). To check for plagiarism issues, the chairs might use external plagiarism detection software.  \n All publications are subject to the ACM Author Representations policy  .  \n By submitting your article to an ACM Publication, you are hereby acknowledging that you and your co-authors are subject to all ACM Publications Policies  , including ACM’s new Publications Policy on Research Involving Human Participants and Subjects  .  \n Alleged violations to any of the above policies will be reported to ACM for further investigation and may result in a full retraction of your paper, in addition to other potential penalties, as per the ACM Publications Policies.  \n Please ensure that you and your co-authors obtain an ORCID ID, so you can complete the publishing process if your paper is accepted. ACM has been involved in ORCID from the start and they have recently made a commitment to collect ORCID IDs from all published authors. ACM is committed to improve author discoverability, ensure proper attribution and contribute to ongoing community efforts around name normalization; your ORCID ID will help in these efforts.  \n The authors of accepted papers are invited and strongly encouraged to attend the conference to present their work. Attendance at the event is not mandatory for publication. Authors also have the option of not presenting their work at the conference, in which case they do not need to register.  \n Important Dates   \n All dates are 23:59:59 AoE (UTC-12h)  \n Paper registration: | September 5, 2024 | (to register a paper, paper title, abstract, author list, and some additional metadata are required; title and abstract | must | contain sufficient information for effective bidding; registrations containing empty or generic title and abstract may be dropped) \n  Full paper submission: | September 12, 2024 \n  Author response: | November 22-26, 2024 \n  Initial notification: January 14, 2024 (long discussion period due to year-end holidays) \n  Revised manuscript submissions (major revisions only): February 25, 2025 \n  Final notification for major revisions: April 1, 2025 \n  Camera ready: April 24, 2025 \n  The official publication date is the date the journal issue is made available in the ACM Digital Library. This date may be as early as July 1, 2025. The official publication date affects the deadline for any patent filings related to published work. Please also note that the names and list of authors as well as the title in the camera-ready version cannot be modified from the ones in the submitted version unless there is explicit approval from the track chairs.  \n Open Science Policy   \n The research track of FSE has introduced an open science policy. Openness in science is key to fostering scientific progress via transparency, reproducibility, and replicability. The steering principle is that all research results should be accessible to the public, if possible, and that empirical studies should be reproducible. In particular, we actively support the adoption of open data and open source principles and encourage all contributing authors to disclose (anonymized and curated) data to increase reproducibility and replicability.  \n Upon submission to the research track, authors are asked to make a replication package available to the program committee (via upload of supplemental material or a link to a private or public repository) or to comment on why this is not possible or desirable. Furthermore, authors are asked to indicate whether they intend to make their data publicly available upon acceptance. We ask authors to provide a supporting statement on the availability of a replication package (or lack thereof) in their submitted papers in a section named Data Availability after the Conclusion section. Be careful that such statements continue to maintain author anonymity. For more details, see the FSE open science policy  .  \n Authors of accepted papers will be given an opportunity (and encouragement) to submit their data and tools to the separate FSE’25 artifact evaluation committee.  \n Topics of Interest   \n Topics of interest include, but are not limited to:  \n Artificial intelligence and machine learning for software engineering \n  Autonomic computing \n  Debugging and fault localization \n  Dependability, safety, and reliability \n  Distributed and collaborative software engineering \n  Embedded software, safety-critical systems, and cyber-physical systems \n  Empirical software engineering \n  Human and social aspects of software engineering \n  Human-computer interaction \n  Mining software repositories \n  Mobile development \n  Model checking \n  Model-driven engineering \n  Parallel, distributed, and concurrent systems \n  Performance engineering \n  Program analysis \n  Program comprehension \n  Program repair \n  Program synthesis \n  Programming languages \n  Recommendation systems \n  Requirements engineering \n  Search-based software engineering \n  Services, components, and cloud \n  Software architectures \n  Software engineering education \n  Software engineering for machine learning and artificial intelligence \n  Software evolution \n  Software processes \n  Software security \n  Software testing \n  Software traceability \n  Symbolic execution \n  Tools and environments \n\n FAQ  \n   \n FAQ on Review Process: Major Revisions, Open Science Policy, Double-Anonymous Reviewing   \n PACMSE Proceedings   \n Q: What paper format shall we follow for FSE 2025?   \n A: Papers accepted by the technical track of FSE 2025 will be published in the inaugural journal issue of the Proceedings of the ACM on Software Engineering (PACMSE). Approval has been granted by ACM in late July. Please check the Research Paper How to Submit  section for details.  \n Q: How would the inaugural PACMSE journal affect FSE 2025?   \n A: FSE will be published in the inaugural PACMSE journal following the recent practices of other communities such as PACMPL (PLDI, POPL, OOPSLA, etc.), PACMHCI, PACMMOD, PACMNET, etc.  \n Identity:  FSE papers will be published in a dedicated issue of PACMSE, with FSE as the issue name. This means that FSE papers will keep their identity!  \n Paper format:  The paper format will follow the ACM’s requirement. This is a switch from the traditional FSE two-column format to this new PACMSE single-column format. However, the amount of content should remain more or less the same: the FSE 2025’s 18 page limit in the singe-column format maps roughly to the old single-column of 10 pages.  \n Review process:  FSE already has a major-revision cycle in 2023 and 2024, which maps neatly onto PACMSE’s requirements for two rounds of reviews, so there are no PACMSE-related changes here.  \n Conference presentations:  FSE 2025’s move to PACMSE changes how the proceedings are published. All accepted papers will still be guaranteed presentation delivery at the conference in the usual way.  \n Policy on Authorship (e.g., regarding ChatGPT)   \n Q: What is the policy on Authorship, especially considering the use of Generative AI tools and technologies, such as ChatGPT?   \n A: Submissions must follow the “ ACM Policy on Authorship  ” released April 20, 2023, which contains policy regarding the use of Generative AI tools and technologies, such as ChatGPT. Please also check the ACM FAQ  which describes in what situations generative AI tools can be used (with or without acknowledgment).  \n Major Revision Process   \n Q: Why is FSE allowing major revisions?   \n A: SE conferences are currently forced to reject papers that include valuable material, but would need major changes to become acceptable for conference presentation, because major revisions cannot be accommodated in the current review process. By supporting only a binary outcome, conferences force reviewers to decide between rejection and acceptance even in borderline cases that would be better judged after a round of major revision. This can cause additional reviewing burden for the community (the paper is resubmitted to another venue with new reviewers) and inconsistency for the authors (the new reviewers have different opinions). We hope by allowing major revisions to both increase the acceptance rate of FSE and to help reduce these current problems with the reviewing process.  \n For Authors   \n Q: If my paper receives major revisions, what happens next?   \n A: The meta-review  will clearly and explicitly list all major changes required by the reviewers to make the paper acceptable for publication. Authors of these papers are granted 6  weeks to implement the requested changes. In addition to the revised paper, authors are asked to submit a response letter that explains how each required change was implemented. If any change was not implemented, authors can explain why. The same reviewers will then review the revised paper and make their final (binary) decision. Authors can also choose to withdraw their submission if they wish.  \n Q: Will major revision become the default decision causing initial acceptance rates to drop?   \n A: This is not the intention: reviewers are instructed to accept all papers that would have been accepted when major revision  was not an available outcome.  \n For Reviewers   \n Q: When shall I recommend major revision  for a paper?   \n A: Major revision  should not become the default choice for borderline papers and should be used only if without major revisions the paper would be rejected, while a properly done major revision, which addresses the reviewers’ concerns, could make the paper acceptable for publication; if the requested changes are doable in 6 weeks and are implementable within the page limit; if the requested changes are strictly necessary for paper acceptance (i.e., not just nice-to-have features); if the requested changes require recheck (i.e., reviewers cannot trust the authors to implement them directly in the camera ready).  \n Q: When shall I recommend rejection  instead of major revision  ?   \n A: Rejection  is a more appropriate outcome than major revision if the requested additions/changes are not implementable in 6 weeks; if the contribution is very narrow or not relevant to the SE audience, and it cannot be retargeted in 6 weeks; if the methodology is flawed and cannot be fixed in 6 weeks; if results are unconvincing, the paper does not seem to improve the state of the art much, and new convincing results are unlikely to be available after 6 weeks of further experiments; if the customary benchmark used in the community was ignored and cannot be adopted and compared to in 6 weeks.  \n Q: When shall I recommend acceptance  instead of major revision  ?   \n A: We do not want major revision to become the primary pathway for acceptance. We should continue to trust the authors to make minor changes to the submissions in the camera ready version. Acceptance  is preferable if the requested additions/changes are nice to have features, not mandatory for the acceptability of the work; if minor improvements of the text are needed; if minor clarifications requested by the reviewers should be incorporated; if important but not critical references should be added and discussed; if discussion of results could be improved, but the current one is already sufficient.  \n Q: What is the difference between major revision  and shepherding  ?   \n A: Major revision  is not shepherding  . While shepherding typically focuses on important but minor changes, which can be specified in an operational way and can be checked quite easily and quickly by reviewers, major revisions require major changes (although doable in 6 weeks), which means the instructions for the authors cannot be completely operational and the check will need to go deeply into the new content delivered by the paper. Hence, while the expectation for shepherded papers is that most of them will be accepted once the requested changes are implemented, this is not necessarily the case with major revisions.  \n Q: Is there a quota of papers that can have major revision  as outcome?  A: As there is no quota for the accepted papers, there is also no quota for major revisions. However, we expect that thanks to major revisions we will be able to eventually accept 10-15% more papers, while keeping the quality bar absolutely unchanged.  \n Q: What shall I write in the meta-review of a paper with major revision outcome?   \n A: With the possibility of a major revision  outcome, meta-reviews become extremely important. The meta-review  should clearly and explicitly list all major changes required by the reviewers to make the paper acceptable for publication. The meta-review should act as a contract between reviewers and authors, such that when all required changes are properly made, the paper is accepted. In this respect, the listed changes should be extremely clear, precise, and implementable.  \n Review Process   \n For Authors   \n Q: Can I withdraw my paper?   \n A: Yes, papers can be withdrawn at any time using HotCRP.  \n Q: Is appendix or other supplemental materials allowed?   \n A: The main submission file must follow the page limit. Any supplemental materials including appendix and replication packages must be submitted separately under “Supplemental Material”. Program Committee members can review supplemental materials but are not obligated to review them.  \n For Reviewers   \n Q: The authors have provided a URL to supplemental material. I would like to see the material but I worry they will snoop my IP address and learn my identity. What should I do?   \n A: Contact the Program Co-Chairs, who will download the material on your behalf and make it available to you.  \n Q: If I am assigned a paper for which I feel I am not an expert, how do I seek an outside review?   \n A: PC members should do their own reviews, not delegate them to someone else. Please contact the Program Co-Chairs, especially since additional reviewers might have a different set of conflicts of interest.  \n Open Science Policy   \n Q: What is the FSE 2025 open science policy and how can I follow it?  \n A: Openness in science is key to fostering scientific progress via transparency, reproducibility, and replicability. Upon submission to the research track, authors are asked to:  \n make their data available to the program committee (via upload of supplemental material or a link to an anonymous repository) and provide instructions on how to access this data in the paper; or \n  include in the paper an explanation as to why this is not possible or desirable; and \n  indicate if they intend to make their data publicly available upon acceptance. This information should be provided in the submitted papers in a section named Data Availability after the Conclusion section. For more details, see the | FSE open science policy | . | Q: How can I upload supplementary material via the HotCRP site and make it anonymous for double-anonymous review? \n  A: To conform to the double-anonymous policy, please include an anonymized URL. Code and data repositories may be exported to remove version control history, scrubbed of names in comments and metadata, and anonymously uploaded to a sharing site. Instructions are provided in the FSE open science policy  .  \n Double-Anonymous Reviewing (DAR)   \n Q: Why are you using double-anonymous reviewing?   \n A: Studies have shown that a reviewer’s attitude toward a submission may be affected, even unconsciously, by the identity of the authors.  \n Q: Do you really think DAR actually works? I suspect reviewers can often guess who the authors are anyway.   \n A: It is rare for authorship to be guessed correctly, even by expert reviewers, as detailed in this study  .  \n For Authors   \n Q: What exactly do I have to do to anonymize my paper?   \n A: Your job is not to make your identity undiscoverable but simply to make it possible for reviewers to evaluate your submission without having to know who you are: omit authors’ names from your title page, and when you cite your own work, refer to it in the third person. Also, be sure not to include any acknowledgements that would give away your identity. You should also avoid revealing the institutional affiliation of authors.  \n Q: I would like to provide supplementary material for consideration, e.g., the code of my implementation or proofs of theorems. How do I do this?   \n A: On the submission site, there will be an option to submit supplementary material along with your main paper. You can also share supplementary material in a private or publicly shared repository (preferred). This supplementary material should also be anonymized; it may be viewed by reviewers during the review period, so it should adhere to the same double-anonymous guidelines. See instructions on the FSE open science policy  .  \n Q: My submission is based on code available in a public repository. How do I deal with this?   \n A: Making your code publicly available is not incompatible with double-anonymous reviewing. You can create an anonymized version of the repository and include a new URL that points to the anonymized version of the repository, similar to how you would include supplementary materials to adhere to the Open Science policy. Authors wanting to share GitHub repositories may want to look into using https://anonymous.4open.science/  which is an open source tool that helps you to quickly double-anonymize your repository.  \n Q: I am building on my own past work on the WizWoz system. Do I need to rename this system in my paper for purposes of anonymity, so as to remove the implied connection between my authorship of past work on this system and my present submission?  A: Maybe. The core question is really whether the system is one that, once identified, automatically identifies the author(s) and/or the institution. If the system is widely available, and especially if it has a substantial body of contributors and has been out for a while, then these conditions may not hold (e.g., LLVM or HotSpot), because there would be considerable doubt about authorship. By contrast, a paper on a modification to a proprietary system (e.g., Visual C++, or a research project that has not open-sourced its code) implicitly reveals the identity of the authors or their institution. If naming your system essentially reveals your identity (or institution), then anonymize it. In your submission, point out that the system name has been anonymized. If you have any doubts, please contact the Program Co-Chairs.  \n Q: I am submitting a paper that extends my own work that previously appeared at a workshop. Should I anonymize any reference to that prior work?   \n A: No. But we recommend you do not use the same title for your FSE submission, so that it is clearly distinguished from the prior paper. In general, there is rarely a good reason to anonymize a citation. When in doubt, contact the Program Co-Chairs.  \n Q: Am I allowed to post my (non-anonymized) paper on my web page or arXiv?   \n A: You can discuss and present your work that is under submission at small meetings (e.g., job talks, visits to research labs, a Dagstuhl or Shonan meeting), but you should avoid broadly advertising it in a way that reaches the reviewers even if they are not searching for it. Whenever possible, please avoid posting your manuscript on public archives (e.g, ArXiV) before or during the submission period. Would you still prefer to do so, carefully avoid adding to the manuscript any reference to FSE 2025 (e.g., using footnotes saying “Submitted to FSE 2025”).  \n Q: Can I give a talk about my work while it is under review? How do I handle social media?   \n A: We have developed guidelines, described here, to help everyone navigate in the same way the tension between the normal communication of scientific results, which double-anonymous reviewing should not impede, and actions that essentially force potential reviewers to learn the identity of the authors for a submission. Roughly speaking, you may (of course!) discuss work under submission, but you should not broadly advertise your work through media that is likely to reach your reviewers. We acknowledge there are grey areas and trade-offs; we cannot describe every possible scenario.  \n Things you may do:  \n Put your submission on your home page. \n  Discuss your work with anyone who is not on the review committees, or with people on the committees with whom you already have a conflict. \n  Present your work at professional meetings, job interviews, etc. \n  Submit work previously discussed at an informal workshop, previously posted on arXiv or a similar site, previously submitted to a conference not using double-anonymous reviewing, etc. \n  Things you should not do:  \n Contact members of the review committees about your work, or deliberately present your work where you expect them to be. \n  Publicize your work on major mailing lists used by the community (because potential reviewers likely read these lists). \n  Publicize your work on social media if wide public [re-]propagation is common (e.g., Twitter) and therefore likely to reach potential reviewers. For example, on Facebook, a post with a broad privacy setting (public or all friends) saying, “Whew, FSE paper in, time to sleep” is okay, but one describing the work or giving its title is not appropriate. Alternatively, a post to a group including only the colleagues at your institution is fine. \n  Reviewers will not be asked to recuse themselves from reviewing your paper unless they feel you have gone out of your way to advertise your authorship information to them. If you are unsure about what constitutes “going out of your way”, please contact the Program Co-Chairs.  \n Q: Will the fact that FSE is double-anonymous have an impact on handling conflicts of interest?   \n A: Double-anonymous reviewing does not change the principle that reviewers should not review papers with which they have a conflict of interest, even if they do not immediately know who the authors are. Authors declare conflicts of interest when submitting their papers using the guidelines in the Call for Papers. Papers will not be assigned to reviewers who have a conflict. Note that you should not declare gratuitous conflicts of interest and the chairs will compare the conflicts declared by the authors with those declared by the reviewers. Papers abusing the system will be desk-rejected.  \n For Reviewers   \n Q: What should I do if I learn the authors’ identity? What should I do if a prospective FSE author contacts me and asks to visit my institution?  A: If you feel that the authors’ actions are largely aimed at ensuring that potential reviewers know their identity, contact the Program Co-Chairs. Otherwise, you should not treat double-anonymous reviewing differently from other reviewing. In particular, refrain from seeking out information on the authors’ identity, but if you discover it accidentally this will not automatically disqualify you as a reviewer. Use your best judgement.  \n Q: How do we handle potential conflicts of interest since I cannot see the author names?   \n A: The conference review system will ask that you identify conflicts of interest when you get an account on the submission system.  \n Q: How should I avoid learning the authors’ identity, if I am using web-search in the process of performing my review?   \n A: You should make a good-faith effort not to find the authors’ identity during the review period, but if you inadvertently do so, this does not disqualify you from reviewing the paper. As part of the good-faith effort, please turn off Google Scholar auto-notifications. Please do not use search engines with terms like the paper’s title or the name of a new system being discussed. If you need to search for related work you believe exists, do so after completing a preliminary review of the paper.  \n The above guidelines are partly based on the PLDI FAQ on double-anonymous reviewing and the ICSE 2023 guidelines on double-anonymous submissions.  \n\n Important Dates   AoE (UTC-12h)     \n\n Tue 14 Jan 2025  \n  Initial notification \n Tue 11 Feb 2025  \n  Camera ready (directly accepted paper) \n Tue 25 Feb 2025  \n  Submission for major-revision papers \n Tue 1 Apr 2025  \n  Final notification for major revisions \n Thu 24 Apr 2025  \n  Camera ready (major revisions) \n Fri 22 - Tue 26 Nov 2024   \n  Author response \n Thu 12 Sep 2024   \n  Full paper submission \n Thu 5 Sep 2024   \n  Paper registration \n\n Submission Link   \n   \n   https://fse2025.hotcrp.com     \n   \n Program Committee    \n   \n Denys Poshyvanyk Program Co-Chair    \n William & Mary   \n United States \n  Dongmei Zhang Program Co-Chair    \n Microsoft Research   \n China \n  Iftekhar Ahmed    \n University of California at Irvine   \n United States \n  Dalal Alrajeh    \n Imperial College London   \n United Kingdom \n  Wesley Assunção    \n North Carolina State University   \n United States \n  Hamid Bagheri    \n University of Nebraska-Lincoln   \n United States \n  Guangdong Bai    \n University of Queensland   \n Australia \n  Luciano Baresi    \n Politecnico di Milano   \n Italy \n  Alexandre Bartel    \n Umeå University   \n Sweden \n  Gabriele Bavota    \n Software Institute @ Università della Svizzera Italiana   \n Switzerland \n  Dirk Beyer    \n LMU Munich   \n Germany \n  Domenico Bianculli    \n University of Luxembourg   \n Luxembourg \n  Amiangshu Bosu    \n Wayne State University   \n United States \n  Víctor Braberman    \n ICC (UBA-CONICET)   \n Argentina \n  John Businge    \n University of Nevada, Las Vegas   \n United States \n  Joanna C. S. Santos    \n University of Notre Dame   \n United States \n  Bruno Cafeo    \n University of Campinas (Unicamp)   \n Brazil \n  Haipeng Cai    \n University at Buffalo, SUNY   \n United States \n  Yan Cai    \n Institute of Software at Chinese Academy of Sciences   \n China \n  Jialun Cao    \n Hong Kong University of Science and Technology   \n China \n  Saikat Chakraborty    \n Microsoft Research   \n United States \n  Satish Chandra    \n Google, Inc   \n United States \n  Oscar Chaparro    \n William & Mary   \n United States \n  Preetha Chatterjee    \n Drexel University, USA   \n United States \n  Souti Chattopadhyay    \n University of Southern California   \n United States \n  Chunyang Chen    \n TU Munich   \n Germany \n  Tse-Hsun (Peter) Chen    \n Concordia University   \n Canada \n  Yuting Chen    \n Shanghai Jiao Tong University   \n China \n  Shing-Chi Cheung    \n Hong Kong University of Science and Technology   \n China \n  Anthony Cleve    \n University of Namur   \n Belgium \n  Michael L. Collard    \n The University of Akron   \n United States \n  Maxime Cordy    \n University of Luxembourg, Luxembourg \n  Kostadin Damevski    \n Virginia Commonwealth University   \n United States \n  James C. Davis    \n Purdue University   \n United States \n  Dario Di Nucci    \n University of Salerno \n  Zhen Dong    \n Fudan University   \n China \n  Wensheng Dou    \n Institute of Software Chinese Academy of Sciences   \n China \n  Robert Dyer    \n University of Nebraska-Lincoln   \n United States \n  Davide Falessi    \n University of Rome Tor Vergata, Italy   \n Italy \n  Chunrong Fang    \n Nanjing University   \n China \n  Mattia Fazzini    \n University of Minnesota   \n United States \n  Rudolf Ferenc    \n University of Szeged   \n Hungary \n  Antonio Filieri    \n AWS and Imperial College London   \n United States \n  Michael Foster    \n The University of Sheffield   \n United Kingdom \n  Gordon Fraser    \n University of Passau   \n Germany \n  Alessio Gambi    \n Austrian Institute of Technology (AIT)   \n Austria \n  Cuiyun Gao    \n Harbin Institute of Technology   \n China \n  Zhipeng Gao    \n Shanghai Institute for Advanced Study - Zhejiang University   \n China \n  Joshua Garcia    \n University of California, Irvine   \n United States \n  Paul Gazzillo    \n University of Central Florida   \n United States \n  Ali Ghanbari    \n Auburn University   \n United States \n  Gouri Ginde (Deshpande)    \n University of Calgary   \n Canada \n  Alessandra Gorla    \n IMDEA Software Institute   \n Spain \n  Georgios Gousios    \n Endor Labs & Delft University of Technology   \n Netherlands \n  Lars Grunske    \n Humboldt-Universität zu Berlin   \n Germany \n  Muhammad Ali Gulzar    \n Virginia Tech   \n United States \n  DongGyun Han    \n Royal Holloway, University of London   \n United Kingdom \n  Dan Hao    \n Peking University   \n China \n  Shinpei Hayashi    \n Tokyo Institute of Technology   \n Japan \n  Pinjia He    \n Chinese University of Hong Kong, Shenzhen   \n China \n  Shilin He    \n Microsoft Research   \n China \n  Vincent J. Hellendoorn    \n Carnegie Mellon University   \n United States \n  Xing Hu    \n Zhejiang University   \n China \n  Paola Inverardi    \n Gran Sasso Science Institute   \n Italy \n  Maliheh Izadi    \n Delft University of Technology   \n Netherlands \n  Reyhaneh Jabbarvand    \n University of Illinois at Urbana-Champaign   \n United States \n  Jiajun Jiang    \n Tianjin University   \n China \n  Lingxiao Jiang    \n Singapore Management University   \n Singapore \n  Siyuan Jiang    \n Eastern Michigan University \n  Yu Jiang    \n Tsinghua University   \n China \n  Zhen Ming (Jack) Jiang    \n York University   \n Canada \n  Yasutaka Kamei    \n Kyushu University   \n Japan \n  Maria Kechagia    \n University College London   \n United Kingdom \n  Martin Kellogg    \n New Jersey Institute of Technology   \n United States \n  Foutse Khomh    \n Polytechnique Montréal   \n Canada \n  Sarfraz Khurshid    \n University of Texas at Austin   \n United States \n  Moonzoo Kim    \n KAIST / VPlusLab Inc.   \n South Korea \n  Vladimir Kovalenko    \n JetBrains Research   \n Netherlands \n  Raula Gaikovina Kula    \n Osaka University   \n Japan \n  Christian Kästner    \n Carnegie Mellon University   \n United States \n  Thomas LaToza    \n George Mason University   \n United States \n  Julia Lawall    \n Inria   \n France \n  Claire Le Goues    \n Carnegie Mellon University   \n United States \n  Kevin Leach    \n Vanderbilt University   \n United States \n  Philipp Leitner    \n Chalmers | University of Gothenburg   \n Sweden \n  Dayi Lin    \n Centre for Software Excellence, Huawei Canada   \n Canada \n  Yun Lin    \n Shanghai Jiao Tong University   \n China \n  Mario Linares-Vasquez    \n Universidad de los Andes   \n Colombia \n  Lingfeng Bao    \n Zhejiang University   \n China \n  Hui Liu    \n Beijing Institute of Technology   \n China \n  Ting Liu    \n Xi'an Jiaotong University   \n China \n  Yepang Liu    \n Southern University of Science and Technology   \n China \n  Zhongxin Liu    \n Zhejiang University   \n China \n  David Lo    \n Singapore Management University   \n Singapore \n  Crista Lopes    \n University of California Irvine   \n United States \n  Minghua Ma    \n Microsoft Research   \n United States \n  Lech Madeyski    \n Wroclaw University of Science and Technology   \n Poland \n  Anas \"Nash\" Mahmoud    \n Louisiana State University   \n United States \n  Sam Malek    \n University of California at Irvine   \n United States \n  Jonathan I. Maletic    \n Kent State University \n  Leonardo Mariani    \n University of Milano-Bicocca   \n Italy \n  Antonio Mastropaolo    \n William and Mary, USA   \n United States \n  Collin McMillan    \n University of Notre Dame   \n United States \n  Phil McMinn    \n University of Sheffield   \n United Kingdom \n  Sergey Mechtaev    \n Peking University   \n China \n  Tim Menzies    \n North Carolina State University   \n United States \n  Daniela Micucci    \n University of Milano-Bicocca, Italy   \n Italy \n  Sasa Misailovic    \n University of Illinois at Urbana-Champaign   \n United States \n  Dimitris Mitropoulos    \n University of Athens   \n Greece \n  Emerson Murphy-Hill    \n Google   \n United States \n  André N. Meyer    \n University of Zurich   \n Switzerland \n  Mei Nagappan    \n University of Waterloo   \n Canada \n  Christian D. Newman    \n Rochester Institute of Technology   \n United States \n  Phuong T. Nguyen    \n University of L’Aquila   \n Italy \n  Nan Niu    \n University of Cincinnati   \n United States \n  Nicole Novielli    \n University of Bari   \n Italy \n  Rocco Oliveto    \n University of Molise   \n Italy \n  John-Paul Ore    \n North Carolina State University   \n United States \n  Fabio Palomba    \n University of Salerno   \n Italy \n  Sebastiano Panichella    \n University of Bern   \n Switzerland \n  Liliana Pasquale    \n University College Dublin & Lero   \n Ireland \n  Chao Peng    \n ByteDance   \n China \n  Martin Pinzger    \n Universität Klagenfurt   \n Austria \n  Michael Pradel    \n University of Stuttgart   \n Germany \n  Sebastian Proksch    \n Delft University of Technology   \n Netherlands \n  Rahul Purandare    \n University of Nebraska-Lincoln   \n United States \n  Profir-Petru Pârțachi    \n National Institute of Informatics, Japan   \n Japan \n  Masud Rahman    \n Dalhousie University   \n Canada \n  Baishakhi Ray    \n Columbia University, New York; AWS AI Lab   \n United States \n  Xiaoxue Ren    \n Zhejiang University   \n China \n  Peter Rigby    \n Concordia University; Meta   \n Canada \n  Gregorio Robles    \n Universidad Rey Juan Carlos   \n Spain \n  Daniel Russo    \n Department of Computer Science, Aalborg University   \n Denmark \n  Indranil Saha    \n IIT Kanpur   \n India \n  Hitesh Sajnani    \n The Trade Desk   \n United States \n  Simone Scalabrino    \n University of Molise   \n Italy \n  Giuseppe Scanniello    \n University of Salerno   \n Italy \n  Francisco Servant    \n ITIS Software, University of Malaga   \n Spain \n  Weiyi Shang    \n University of Waterloo   \n Canada \n  Zohreh Sharafi    \n Polytechnique Montréal   \n Canada \n  Bonita Sharif    \n University of Nebraska-Lincoln, USA   \n United States \n  Elena Sherman    \n Boise State University   \n United States \n  August Shi    \n The University of Texas at Austin   \n United States \n  Diomidis Spinellis    \n Athens University of Economics and Business & Delft University of Technology   \n Greece \n  Rodrigo Spinola    \n Virginia Commonwealth University   \n United States \n  Andrea Stocco    \n Technical University of Munich, fortiss   \n Germany \n  Ting Su    \n East China Normal University   \n China \n  Jun Sun    \n Singapore Management University   \n Singapore \n  Xiaobing Sun    \n Yangzhou University   \n China \n  Xiaoyu Sun    \n Australian National University, Australia   \n Australia \n  Tian Tan    \n Nanjing University   \n China \n  Xin Tan    \n Beihang University   \n China \n  Kla Tantithamthavorn    \n Monash University   \n Australia \n  Patanamon Thongtanunam    \n University of Melbourne   \n Australia \n  Thomas Thüm    \n Paderborn University   \n Germany \n  Yuan Tian    \n Queen's University, Kingston, Ontario   \n Canada \n  Christoph Treude    \n Singapore Management University   \n Singapore \n  T.H. Tse    \n The University of Hong Kong, Hong Kong   \n Hong Kong SAR China \n  Michele Tufano    \n Google   \n United States \n  Rosalia Tufano    \n Università della Svizzera Italiana   \n Switzerland \n  Gias Uddin    \n York University, Canada   \n Canada \n  Christopher Vendome    \n Miami University   \n United States \n  Zhiyuan Wan    \n Zhejiang University   \n China \n  Bo Wang    \n Beijing Jiaotong University   \n China \n  Chengpeng Wang    \n Purdue University   \n United States \n  Chong Wang    \n Nanyang Technological University   \n Singapore \n  Haoyu Wang    \n Huazhong University of Science and Technology   \n China \n  Shaowei Wang    \n University of Manitoba   \n Canada \n  Wenwen Wang    \n University of Georgia   \n United States \n  Yanlin Wang    \n Sun Yat-sen University   \n China \n  Ying Wang    \n Northeastern University   \n China \n  Hironori Washizaki    \n Waseda University   \n Japan \n  Shiyi Wei    \n University of Texas at Dallas   \n United States \n  Ming Wen    \n Huazhong University of Science and Technology   \n China \n  Martin White    \n Syneos Health   \n United States \n  Laurie Williams    \n North Carolina State University   \n United States \n  Rongxin Wu    \n Xiamen University   \n China \n  Xin Xia    \n Huawei   \n China \n  Xusheng Xiao    \n Arizona State University   \n United States \n  Tao Xie    \n Peking University   \n China \n  Bowen Xu    \n North Carolina State University   \n United States \n  Chang Xu    \n Nanjing University   \n China \n  Xiwei (Sherry) Xu    \n Data61, CSIRO   \n Australia \n  Jun Yan    \n Institute of Software, Chinese Academy of Sciences   \n China \n  Guowei Yang    \n University of Queensland   \n Australia \n  Jooyong Yi    \n UNIST   \n South Korea \n  Tingting Yu    \n University of Connecticut   \n United States \n  Yijun Yu    \n The Open University, UK   \n United Kingdom \n  Fiorella Zampetti    \n University of Sannio, Italy   \n Italy \n  Juan Zhai    \n University of Massachusetts at Amherst   \n United States \n  Hongyu Zhang    \n Chongqing University   \n China \n  Qian Zhang    \n University of California at Riverside   \n United States \n  Tianyi Zhang    \n Purdue University   \n United States \n  Xiangyu Zhang    \n Purdue University   \n United States \n  Jianjun Zhao    \n Kyushu University   \n Japan \n  Yanjie Zhao    \n Huazhong University of Science and Technology   \n China \n  Hao Zhong    \n Shanghai Jiao Tong University   \n China \n  Andrea Zisman    \n The Open University   \n United Kingdom \n  Ying Zou    \n Queen's University, Kingston, Ontario   \n Canada \n  Zhiqiang Zuo    \n Nanjing University   \n China \n\n x  Sat 14 Dec 01:50    \n\n  FSE 2025   \n  contact form    \n  using conf.researchr.org  ( v1.68.0  )  \n   Support page    \n     \n Tracks  \n How to Submit   \n  Research Papers   \n  Industry Papers   \n  Ideas, Visions and Reflections   \n  Journal First   \n  Student Research Competition   \n  Demonstrations   \n  Posters   \n  Artifacts   \n  Doctoral Symposium   \n  New Faculty Symposium   \n  Software Engineering Education   \n  Tutorials   \n  Student Volunteers   \n  Industry Mentoring Symposium   \n  Workshops   \n  Open Science Policy    \n Workshops  \n 2030 Software Engineering 2025   \n  AI IDE 2025   \n  AI-SDLC 2025   \n  BI4LLMC 2025   \n  CauSE 2025   \n  DevOpsSustain 2025   \n  FaSE4Games 2025   \n  HumanAISE 2025   \n  Intersectionality@FSE 2025   \n  LLMapp 2025   \n  LLanMER 2025   \n  QSE-NE 2025   \n  ResponsibleSE 2025   \n  SWGeno 2025    \n\n Attending  \n Venue: Clarion Hotel Trondheim   \n  Diversity and Inclusion Plan   \n  Code of Conduct    \n\n  \nImportant Dates data:\nFSE 2025   Mon 23 - Fri 27 June 2025 Trondheim, Norway    \n co-located with ISSTA 2025    \n\n Toggle navigation        \n Attending | Venue: Clarion Hotel Trondheim \n  Diversity and Inclusion Plan \n  Code of Conduct \n  Sponsorship | Sponsorship Opportunities \n  Sponsors and Supporters \n  Tracks | FSE 2025 \n  How to Submit \n  Research Papers \n  Industry Papers \n  Ideas, Visions and Reflections \n  Journal First \n  Student Research Competition \n  Demonstrations \n  Posters \n  Artifacts \n  Doctoral Symposium \n  New Faculty Symposium \n  Software Engineering Education \n  Tutorials \n  Student Volunteers \n  Industry Mentoring Symposium \n  Workshops \n  Open Science Policy \n   Co-hosted Conferences \n  ISSTA \n  Workshops \n  2030 Software Engineering \n  AI IDE \n  AI-SDLC \n  BI4LLMC \n  CauSE \n  DevOpsSustain \n  FaSE4Games \n  HumanAISE \n  Intersectionality@FSE \n  LLMapp \n  LLanMER \n  QSE-NE \n  ResponsibleSE \n  SWGeno \n  Organization | FSE 2025 Committees \n  Organizing Committee \n  Steering Committee \n  Track Committees \n  Research Papers \n  Industry Papers \n  Ideas, Visions and Reflections \n  Journal First \n  Student Research Competition \n  Demonstrations \n  Posters \n  Artifacts \n  Doctoral Symposium \n  New Faculty Symposium \n  Software Engineering Education \n  Tutorials \n  Student Volunteers \n  Industry Mentoring Symposium \n  Workshops \n  Contributors \n  People Index \n   Workshops \n  2030 Software Engineering | Program Committee \n  AI IDE | Organisation Committee \n  Program Committee \n  AI-SDLC | N/A - check homepage \n  BI4LLMC | N/A - check homepage \n  CauSE | N/A - check homepage \n  DevOpsSustain | N/A - check homepage \n  FaSE4Games | N/A - check homepage \n  HumanAISE | N/A - check homepage \n  Intersectionality@FSE | N/A - check homepage \n  LLMapp | N/A - check homepage \n  LLanMER | N/A - check homepage \n  QSE-NE | N/A - check homepage \n  ResponsibleSE | N/A - check homepage \n  SWGeno | N/A - check homepage \n  Search \n  Series | Series \n   FSE 2025 \n  FSE 2024 \n  ESEC/FSE 2023 \n  ESEC/FSE 2022 \n  ESEC/FSE 2021 \n  ESEC/FSE 2020 \n  ESEC/FSE 2018 \n  Sign in \n  Sign up \n\n  FSE 2025  ( series  ) /  Research Papers FSE 2025   \n   \n Call for Papers \n  FAQ \n  Call for Papers  \n  \n We invite high-quality submissions, from both industry and academia, describing original and unpublished results of theoretical, empirical, conceptual, and experimental software engineering research.  \n Contributions should describe innovative and significant original research. Papers describing groundbreaking approaches to emerging problems are also welcome, as well as replication papers. Submissions that facilitate reproducibility by using available datasets or making the described tools and datasets publicly available are especially encouraged. For a list of specific topics of interest, please see the end of this call.  \n Note #1:  The Proceedings of the ACM on Software Engineering (PACMSE)  Issue FSE 2025 seeks contributions through submissions in this track. Accepted papers will be invited for presentation at FSE 2025. Approval has been granted by ACM in July 2023. PACMSE will be the only proceedings where accepted research track papers will be published. Please check the FAQ  for details.  \n Note #2:  The steering committee has decided that starting from 2024 the conference name will be changed to ACM International Conference on the Foundations of Software Engineering (FSE).  \n Note #3:  Based on the coordination among FSE, ICSE, and ASE steering committees, the FSE conference and submission dates have been moved earlier, similarly to FSE 2024 deadlines. The intention is for this schedule to remain stable in the years ahead and the conference and submission deadlines of the three large general software engineering conferences to be spread out throughout the year.  \n Note #4:  Submissions must follow the “ ACM Policy on Authorship  ” released April 20, 2023, which contains policy regarding the use of Generative AI tools and technologies, such as ChatGPT. Please also check the ACM FAQ  which describes in what situations generative AI tools can be used (with or without acknowledgement).  \n Note #5:  The names and list of authors as well as the title in the camera-ready version cannot be modified from the ones in the submitted version unless there is explicit approval from the track chairs.  \n Note #6:  Submissions that are changing the required submission format to gain additional space will be desk rejected. Examples of changing format include removing the ACM Reference format and the permission to make digital or hard copy footnotes on the first page.  \n Tracks   \n This CFP refers to the Research Track of FSE 2025. For the remaining tracks, please check the specific calls on the website: https://conf.researchr.org/home/fse-2025   \n HOW TO SUBMIT   \n The following only applies to the main track of FSE. For the other tracks please see the general formatting instructions  .   \n At the time of submission, each paper should have no more than 18 pages for all text and figures, plus 4 pages for references, using the following templates: Latex  or Word (Mac)  or Word (Windows)  . Authors using LaTeX should use the sample-acmsmall-conf.tex  file (found in the samples folder of the acmart package) with the acmsmall  option. We also strongly encourage the use of the review, screen, and anonymous options as well. In summary, you want to use: \\documentclass[acmsmall,screen,review,anonymous]{acmart}  . Papers may be submitted using numeric citations, but final versions of accepted papers must use the author-year format for citations. It is a single-column page layout. Submissions that do not comply with the above instructions will be desk rejected without review. Papers must be submitted electronically through the FSE 2025 submission site:  \n https://fse2025.hotcrp.com   \n Each submission will be reviewed by at least three members of the program committee. The review process is that the initial output can be accept, reject or major revision  . When the initial output of the three reviews is major revision, authors will have an opportunity to address the reviewers’ requests during a 6-week  major revision period. Such requests may include additional experiments or new analyses of existing results; major rewriting of algorithms and explanations; clarifications, better scoping, and improved motivations. The revised submission must be accompanied by a response letter  , where the authors explain how they addressed each concern expressed by the reviewers. The same reviewers who requested major revisions will then assess whether the revised submission satisfies their requests adequately.  \n Submissions will be evaluated on the basis of originality, importance of contribution, soundness, evaluation (if relevant), quality of presentation, and appropriate comparison to related work. Some papers may have more than three reviews, as PC chairs may solicit additional reviews based on factors such as reviewer expertise and strong disagreement between reviewers. The program committee as a whole will make final decisions about which submissions to accept for publication.  \n In addition to declaring the topics which are relevant for their submissions, authors will be asked to declare the research methods employed in their submissions. This will enable us to ensure reviewer expertise both for research methods and topics. For full definitions of the research methods, see the SIGSOFT Empirical Standards  .  \n Double-Anonymous Review Process   \n In order to ensure the fairness of the reviewing process, the FSE 2025 Research Papers Track will employ a double-anonymous review process, where reviewers do not know the identity of authors, and authors do not know the identity of external reviewers. The papers submitted must not reveal the authors’ identities in any way:  \n Authors should leave out author names and affiliations from the body of their submission. \n  Authors should ensure that any citation to related work by themselves is written in third person, that is, “the prior work of XYZ” as opposed to “our prior work”. \n  Authors should not include URLs to author-revealing sites (tools, datasets). Authors are still encouraged to follow open science principles and submit replication packages, see more details on the open science policy below. \n  Authors should anonymize author-revealing company names but instead provide general characteristics of the organizations involved needed to understand the context of the paper. \n  Authors should ensure that paper acknowledgements do not reveal the origin of their work. \n  While authors have the right to upload preprints on ArXiV or similar sites, they should avoid specifying that the manuscript was submitted to FSE 2025. \n  During review, authors | should not publicly use the submission title | . \n  The double-anonymous process used this year is “heavy”, i.e., the paper anonymity will be maintained during all reviewing and discussion periods. In case of major revision, authors must therefore maintain anonymity in their response letter and must provide no additional information that could be author-revealing.  \n To facilitate double-anonymous reviewing, we recommend the authors to postpone publishing their submitted work on arXiv or similar sites until after the notification  . If the authors have uploaded to arXiv or similar, they should avoid specifying that the manuscript was submitted to FSE 2025.  \n Authors with further questions on double-anonymous reviewing are encouraged to contact the program chairs by email. Papers that do not comply with the double-anonymous review process will be desk-rejected.  \n Submission Policies   \n The authors must follow the “ACM Policy on Authorship” released April 20, 2023 and its accompanying FAQ including the following points:  \n “Generative AI tools and technologies, such as ChatGPT, may not be listed as authors of an ACM published Work. The use of generative AI tools and technologies to create content is permitted but must be fully disclosed in the Work. For example, the authors could include the following statement in the Acknowledgements section of the Work: ChatGPT was utilized to generate sections of this Work, including text, tables, graphs, code, data, citations, etc.). If you are uncertain about the need to disclose the use of a particular tool, err on the side of caution, and include a disclosure in the acknowledgements section of the Work.” \n  “If you are using generative AI software tools to edit and improve the quality of your existing text in much the same way you would use a typing assistant like Grammarly to improve spelling, grammar, punctuation, clarity, engagement or to use a basic word processing system to correct spelling or grammar, it is not necessary to disclose such usage of these tools in your Work.” \n  Please read the full policy and FAQ.  \n Papers submitted for consideration to FSE should not have been already published elsewhere and should not be under review or submitted for review elsewhere during the reviewing period. Specifically, authors are required to adhere to the ACM Policy and Procedures on Plagiarism  and the ACM Policy on Prior Publication and Simultaneous Submissions  .  \n To prevent double submissions, the chairs might compare the submissions with related conferences that have overlapping review periods. The double submission restriction applies only to refereed journals and conferences, not to unrefereed forums (e.g. arXiv.org). To check for plagiarism issues, the chairs might use external plagiarism detection software.  \n All publications are subject to the ACM Author Representations policy  .  \n By submitting your article to an ACM Publication, you are hereby acknowledging that you and your co-authors are subject to all ACM Publications Policies  , including ACM’s new Publications Policy on Research Involving Human Participants and Subjects  .  \n Alleged violations to any of the above policies will be reported to ACM for further investigation and may result in a full retraction of your paper, in addition to other potential penalties, as per the ACM Publications Policies.  \n Please ensure that you and your co-authors obtain an ORCID ID, so you can complete the publishing process if your paper is accepted. ACM has been involved in ORCID from the start and they have recently made a commitment to collect ORCID IDs from all published authors. ACM is committed to improve author discoverability, ensure proper attribution and contribute to ongoing community efforts around name normalization; your ORCID ID will help in these efforts.  \n The authors of accepted papers are invited and strongly encouraged to attend the conference to present their work. Attendance at the event is not mandatory for publication. Authors also have the option of not presenting their work at the conference, in which case they do not need to register.  \n Important Dates   \n All dates are 23:59:59 AoE (UTC-12h)  \n Paper registration: | September 5, 2024 | (to register a paper, paper title, abstract, author list, and some additional metadata are required; title and abstract | must | contain sufficient information for effective bidding; registrations containing empty or generic title and abstract may be dropped) \n  Full paper submission: | September 12, 2024 \n  Author response: | November 22-26, 2024 \n  Initial notification: January 14, 2024 (long discussion period due to year-end holidays) \n  Revised manuscript submissions (major revisions only): February 25, 2025 \n  Final notification for major revisions: April 1, 2025 \n  Camera ready: April 24, 2025 \n  The official publication date is the date the journal issue is made available in the ACM Digital Library. This date may be as early as July 1, 2025. The official publication date affects the deadline for any patent filings related to published work. Please also note that the names and list of authors as well as the title in the camera-ready version cannot be modified from the ones in the submitted version unless there is explicit approval from the track chairs.  \n Open Science Policy   \n The research track of FSE has introduced an open science policy. Openness in science is key to fostering scientific progress via transparency, reproducibility, and replicability. The steering principle is that all research results should be accessible to the public, if possible, and that empirical studies should be reproducible. In particular, we actively support the adoption of open data and open source principles and encourage all contributing authors to disclose (anonymized and curated) data to increase reproducibility and replicability.  \n Upon submission to the research track, authors are asked to make a replication package available to the program committee (via upload of supplemental material or a link to a private or public repository) or to comment on why this is not possible or desirable. Furthermore, authors are asked to indicate whether they intend to make their data publicly available upon acceptance. We ask authors to provide a supporting statement on the availability of a replication package (or lack thereof) in their submitted papers in a section named Data Availability after the Conclusion section. Be careful that such statements continue to maintain author anonymity. For more details, see the FSE open science policy  .  \n Authors of accepted papers will be given an opportunity (and encouragement) to submit their data and tools to the separate FSE’25 artifact evaluation committee.  \n Topics of Interest   \n Topics of interest include, but are not limited to:  \n Artificial intelligence and machine learning for software engineering \n  Autonomic computing \n  Debugging and fault localization \n  Dependability, safety, and reliability \n  Distributed and collaborative software engineering \n  Embedded software, safety-critical systems, and cyber-physical systems \n  Empirical software engineering \n  Human and social aspects of software engineering \n  Human-computer interaction \n  Mining software repositories \n  Mobile development \n  Model checking \n  Model-driven engineering \n  Parallel, distributed, and concurrent systems \n  Performance engineering \n  Program analysis \n  Program comprehension \n  Program repair \n  Program synthesis \n  Programming languages \n  Recommendation systems \n  Requirements engineering \n  Search-based software engineering \n  Services, components, and cloud \n  Software architectures \n  Software engineering education \n  Software engineering for machine learning and artificial intelligence \n  Software evolution \n  Software processes \n  Software security \n  Software testing \n  Software traceability \n  Symbolic execution \n  Tools and environments \n\n FAQ  \n   \n FAQ on Review Process: Major Revisions, Open Science Policy, Double-Anonymous Reviewing   \n PACMSE Proceedings   \n Q: What paper format shall we follow for FSE 2025?   \n A: Papers accepted by the technical track of FSE 2025 will be published in the inaugural journal issue of the Proceedings of the ACM on Software Engineering (PACMSE). Approval has been granted by ACM in late July. Please check the Research Paper How to Submit  section for details.  \n Q: How would the inaugural PACMSE journal affect FSE 2025?   \n A: FSE will be published in the inaugural PACMSE journal following the recent practices of other communities such as PACMPL (PLDI, POPL, OOPSLA, etc.), PACMHCI, PACMMOD, PACMNET, etc.  \n Identity:  FSE papers will be published in a dedicated issue of PACMSE, with FSE as the issue name. This means that FSE papers will keep their identity!  \n Paper format:  The paper format will follow the ACM’s requirement. This is a switch from the traditional FSE two-column format to this new PACMSE single-column format. However, the amount of content should remain more or less the same: the FSE 2025’s 18 page limit in the singe-column format maps roughly to the old single-column of 10 pages.  \n Review process:  FSE already has a major-revision cycle in 2023 and 2024, which maps neatly onto PACMSE’s requirements for two rounds of reviews, so there are no PACMSE-related changes here.  \n Conference presentations:  FSE 2025’s move to PACMSE changes how the proceedings are published. All accepted papers will still be guaranteed presentation delivery at the conference in the usual way.  \n Policy on Authorship (e.g., regarding ChatGPT)   \n Q: What is the policy on Authorship, especially considering the use of Generative AI tools and technologies, such as ChatGPT?   \n A: Submissions must follow the “ ACM Policy on Authorship  ” released April 20, 2023, which contains policy regarding the use of Generative AI tools and technologies, such as ChatGPT. Please also check the ACM FAQ  which describes in what situations generative AI tools can be used (with or without acknowledgment).  \n Major Revision Process   \n Q: Why is FSE allowing major revisions?   \n A: SE conferences are currently forced to reject papers that include valuable material, but would need major changes to become acceptable for conference presentation, because major revisions cannot be accommodated in the current review process. By supporting only a binary outcome, conferences force reviewers to decide between rejection and acceptance even in borderline cases that would be better judged after a round of major revision. This can cause additional reviewing burden for the community (the paper is resubmitted to another venue with new reviewers) and inconsistency for the authors (the new reviewers have different opinions). We hope by allowing major revisions to both increase the acceptance rate of FSE and to help reduce these current problems with the reviewing process.  \n For Authors   \n Q: If my paper receives major revisions, what happens next?   \n A: The meta-review  will clearly and explicitly list all major changes required by the reviewers to make the paper acceptable for publication. Authors of these papers are granted 6  weeks to implement the requested changes. In addition to the revised paper, authors are asked to submit a response letter that explains how each required change was implemented. If any change was not implemented, authors can explain why. The same reviewers will then review the revised paper and make their final (binary) decision. Authors can also choose to withdraw their submission if they wish.  \n Q: Will major revision become the default decision causing initial acceptance rates to drop?   \n A: This is not the intention: reviewers are instructed to accept all papers that would have been accepted when major revision  was not an available outcome.  \n For Reviewers   \n Q: When shall I recommend major revision  for a paper?   \n A: Major revision  should not become the default choice for borderline papers and should be used only if without major revisions the paper would be rejected, while a properly done major revision, which addresses the reviewers’ concerns, could make the paper acceptable for publication; if the requested changes are doable in 6 weeks and are implementable within the page limit; if the requested changes are strictly necessary for paper acceptance (i.e., not just nice-to-have features); if the requested changes require recheck (i.e., reviewers cannot trust the authors to implement them directly in the camera ready).  \n Q: When shall I recommend rejection  instead of major revision  ?   \n A: Rejection  is a more appropriate outcome than major revision if the requested additions/changes are not implementable in 6 weeks; if the contribution is very narrow or not relevant to the SE audience, and it cannot be retargeted in 6 weeks; if the methodology is flawed and cannot be fixed in 6 weeks; if results are unconvincing, the paper does not seem to improve the state of the art much, and new convincing results are unlikely to be available after 6 weeks of further experiments; if the customary benchmark used in the community was ignored and cannot be adopted and compared to in 6 weeks.  \n Q: When shall I recommend acceptance  instead of major revision  ?   \n A: We do not want major revision to become the primary pathway for acceptance. We should continue to trust the authors to make minor changes to the submissions in the camera ready version. Acceptance  is preferable if the requested additions/changes are nice to have features, not mandatory for the acceptability of the work; if minor improvements of the text are needed; if minor clarifications requested by the reviewers should be incorporated; if important but not critical references should be added and discussed; if discussion of results could be improved, but the current one is already sufficient.  \n Q: What is the difference between major revision  and shepherding  ?   \n A: Major revision  is not shepherding  . While shepherding typically focuses on important but minor changes, which can be specified in an operational way and can be checked quite easily and quickly by reviewers, major revisions require major changes (although doable in 6 weeks), which means the instructions for the authors cannot be completely operational and the check will need to go deeply into the new content delivered by the paper. Hence, while the expectation for shepherded papers is that most of them will be accepted once the requested changes are implemented, this is not necessarily the case with major revisions.  \n Q: Is there a quota of papers that can have major revision  as outcome?  A: As there is no quota for the accepted papers, there is also no quota for major revisions. However, we expect that thanks to major revisions we will be able to eventually accept 10-15% more papers, while keeping the quality bar absolutely unchanged.  \n Q: What shall I write in the meta-review of a paper with major revision outcome?   \n A: With the possibility of a major revision  outcome, meta-reviews become extremely important. The meta-review  should clearly and explicitly list all major changes required by the reviewers to make the paper acceptable for publication. The meta-review should act as a contract between reviewers and authors, such that when all required changes are properly made, the paper is accepted. In this respect, the listed changes should be extremely clear, precise, and implementable.  \n Review Process   \n For Authors   \n Q: Can I withdraw my paper?   \n A: Yes, papers can be withdrawn at any time using HotCRP.  \n Q: Is appendix or other supplemental materials allowed?   \n A: The main submission file must follow the page limit. Any supplemental materials including appendix and replication packages must be submitted separately under “Supplemental Material”. Program Committee members can review supplemental materials but are not obligated to review them.  \n For Reviewers   \n Q: The authors have provided a URL to supplemental material. I would like to see the material but I worry they will snoop my IP address and learn my identity. What should I do?   \n A: Contact the Program Co-Chairs, who will download the material on your behalf and make it available to you.  \n Q: If I am assigned a paper for which I feel I am not an expert, how do I seek an outside review?   \n A: PC members should do their own reviews, not delegate them to someone else. Please contact the Program Co-Chairs, especially since additional reviewers might have a different set of conflicts of interest.  \n Open Science Policy   \n Q: What is the FSE 2025 open science policy and how can I follow it?  \n A: Openness in science is key to fostering scientific progress via transparency, reproducibility, and replicability. Upon submission to the research track, authors are asked to:  \n make their data available to the program committee (via upload of supplemental material or a link to an anonymous repository) and provide instructions on how to access this data in the paper; or \n  include in the paper an explanation as to why this is not possible or desirable; and \n  indicate if they intend to make their data publicly available upon acceptance. This information should be provided in the submitted papers in a section named Data Availability after the Conclusion section. For more details, see the | FSE open science policy | . | Q: How can I upload supplementary material via the HotCRP site and make it anonymous for double-anonymous review? \n  A: To conform to the double-anonymous policy, please include an anonymized URL. Code and data repositories may be exported to remove version control history, scrubbed of names in comments and metadata, and anonymously uploaded to a sharing site. Instructions are provided in the FSE open science policy  .  \n Double-Anonymous Reviewing (DAR)   \n Q: Why are you using double-anonymous reviewing?   \n A: Studies have shown that a reviewer’s attitude toward a submission may be affected, even unconsciously, by the identity of the authors.  \n Q: Do you really think DAR actually works? I suspect reviewers can often guess who the authors are anyway.   \n A: It is rare for authorship to be guessed correctly, even by expert reviewers, as detailed in this study  .  \n For Authors   \n Q: What exactly do I have to do to anonymize my paper?   \n A: Your job is not to make your identity undiscoverable but simply to make it possible for reviewers to evaluate your submission without having to know who you are: omit authors’ names from your title page, and when you cite your own work, refer to it in the third person. Also, be sure not to include any acknowledgements that would give away your identity. You should also avoid revealing the institutional affiliation of authors.  \n Q: I would like to provide supplementary material for consideration, e.g., the code of my implementation or proofs of theorems. How do I do this?   \n A: On the submission site, there will be an option to submit supplementary material along with your main paper. You can also share supplementary material in a private or publicly shared repository (preferred). This supplementary material should also be anonymized; it may be viewed by reviewers during the review period, so it should adhere to the same double-anonymous guidelines. See instructions on the FSE open science policy  .  \n Q: My submission is based on code available in a public repository. How do I deal with this?   \n A: Making your code publicly available is not incompatible with double-anonymous reviewing. You can create an anonymized version of the repository and include a new URL that points to the anonymized version of the repository, similar to how you would include supplementary materials to adhere to the Open Science policy. Authors wanting to share GitHub repositories may want to look into using https://anonymous.4open.science/  which is an open source tool that helps you to quickly double-anonymize your repository.  \n Q: I am building on my own past work on the WizWoz system. Do I need to rename this system in my paper for purposes of anonymity, so as to remove the implied connection between my authorship of past work on this system and my present submission?  A: Maybe. The core question is really whether the system is one that, once identified, automatically identifies the author(s) and/or the institution. If the system is widely available, and especially if it has a substantial body of contributors and has been out for a while, then these conditions may not hold (e.g., LLVM or HotSpot), because there would be considerable doubt about authorship. By contrast, a paper on a modification to a proprietary system (e.g., Visual C++, or a research project that has not open-sourced its code) implicitly reveals the identity of the authors or their institution. If naming your system essentially reveals your identity (or institution), then anonymize it. In your submission, point out that the system name has been anonymized. If you have any doubts, please contact the Program Co-Chairs.  \n Q: I am submitting a paper that extends my own work that previously appeared at a workshop. Should I anonymize any reference to that prior work?   \n A: No. But we recommend you do not use the same title for your FSE submission, so that it is clearly distinguished from the prior paper. In general, there is rarely a good reason to anonymize a citation. When in doubt, contact the Program Co-Chairs.  \n Q: Am I allowed to post my (non-anonymized) paper on my web page or arXiv?   \n A: You can discuss and present your work that is under submission at small meetings (e.g., job talks, visits to research labs, a Dagstuhl or Shonan meeting), but you should avoid broadly advertising it in a way that reaches the reviewers even if they are not searching for it. Whenever possible, please avoid posting your manuscript on public archives (e.g, ArXiV) before or during the submission period. Would you still prefer to do so, carefully avoid adding to the manuscript any reference to FSE 2025 (e.g., using footnotes saying “Submitted to FSE 2025”).  \n Q: Can I give a talk about my work while it is under review? How do I handle social media?   \n A: We have developed guidelines, described here, to help everyone navigate in the same way the tension between the normal communication of scientific results, which double-anonymous reviewing should not impede, and actions that essentially force potential reviewers to learn the identity of the authors for a submission. Roughly speaking, you may (of course!) discuss work under submission, but you should not broadly advertise your work through media that is likely to reach your reviewers. We acknowledge there are grey areas and trade-offs; we cannot describe every possible scenario.  \n Things you may do:  \n Put your submission on your home page. \n  Discuss your work with anyone who is not on the review committees, or with people on the committees with whom you already have a conflict. \n  Present your work at professional meetings, job interviews, etc. \n  Submit work previously discussed at an informal workshop, previously posted on arXiv or a similar site, previously submitted to a conference not using double-anonymous reviewing, etc. \n  Things you should not do:  \n Contact members of the review committees about your work, or deliberately present your work where you expect them to be. \n  Publicize your work on major mailing lists used by the community (because potential reviewers likely read these lists). \n  Publicize your work on social media if wide public [re-]propagation is common (e.g., Twitter) and therefore likely to reach potential reviewers. For example, on Facebook, a post with a broad privacy setting (public or all friends) saying, “Whew, FSE paper in, time to sleep” is okay, but one describing the work or giving its title is not appropriate. Alternatively, a post to a group including only the colleagues at your institution is fine. \n  Reviewers will not be asked to recuse themselves from reviewing your paper unless they feel you have gone out of your way to advertise your authorship information to them. If you are unsure about what constitutes “going out of your way”, please contact the Program Co-Chairs.  \n Q: Will the fact that FSE is double-anonymous have an impact on handling conflicts of interest?   \n A: Double-anonymous reviewing does not change the principle that reviewers should not review papers with which they have a conflict of interest, even if they do not immediately know who the authors are. Authors declare conflicts of interest when submitting their papers using the guidelines in the Call for Papers. Papers will not be assigned to reviewers who have a conflict. Note that you should not declare gratuitous conflicts of interest and the chairs will compare the conflicts declared by the authors with those declared by the reviewers. Papers abusing the system will be desk-rejected.  \n For Reviewers   \n Q: What should I do if I learn the authors’ identity? What should I do if a prospective FSE author contacts me and asks to visit my institution?  A: If you feel that the authors’ actions are largely aimed at ensuring that potential reviewers know their identity, contact the Program Co-Chairs. Otherwise, you should not treat double-anonymous reviewing differently from other reviewing. In particular, refrain from seeking out information on the authors’ identity, but if you discover it accidentally this will not automatically disqualify you as a reviewer. Use your best judgement.  \n Q: How do we handle potential conflicts of interest since I cannot see the author names?   \n A: The conference review system will ask that you identify conflicts of interest when you get an account on the submission system.  \n Q: How should I avoid learning the authors’ identity, if I am using web-search in the process of performing my review?   \n A: You should make a good-faith effort not to find the authors’ identity during the review period, but if you inadvertently do so, this does not disqualify you from reviewing the paper. As part of the good-faith effort, please turn off Google Scholar auto-notifications. Please do not use search engines with terms like the paper’s title or the name of a new system being discussed. If you need to search for related work you believe exists, do so after completing a preliminary review of the paper.  \n The above guidelines are partly based on the PLDI FAQ on double-anonymous reviewing and the ICSE 2023 guidelines on double-anonymous submissions.  \n\n Important Dates   AoE (UTC-12h)     \n\n Tue 14 Jan 2025  \n  Initial notification \n Tue 11 Feb 2025  \n  Camera ready (directly accepted paper) \n Tue 25 Feb 2025  \n  Submission for major-revision papers \n Tue 1 Apr 2025  \n  Final notification for major revisions \n Thu 24 Apr 2025  \n  Camera ready (major revisions) \n Fri 22 - Tue 26 Nov 2024   \n  Author response \n Thu 12 Sep 2024   \n  Full paper submission \n Thu 5 Sep 2024   \n  Paper registration \n\n Submission Link   \n   \n   https://fse2025.hotcrp.com     \n   \n Program Committee    \n   \n Denys Poshyvanyk Program Co-Chair    \n William & Mary   \n United States \n  Dongmei Zhang Program Co-Chair    \n Microsoft Research   \n China \n  Iftekhar Ahmed    \n University of California at Irvine   \n United States \n  Dalal Alrajeh    \n Imperial College London   \n United Kingdom \n  Wesley Assunção    \n North Carolina State University   \n United States \n  Hamid Bagheri    \n University of Nebraska-Lincoln   \n United States \n  Guangdong Bai    \n University of Queensland   \n Australia \n  Luciano Baresi    \n Politecnico di Milano   \n Italy \n  Alexandre Bartel    \n Umeå University   \n Sweden \n  Gabriele Bavota    \n Software Institute @ Università della Svizzera Italiana   \n Switzerland \n  Dirk Beyer    \n LMU Munich   \n Germany \n  Domenico Bianculli    \n University of Luxembourg   \n Luxembourg \n  Amiangshu Bosu    \n Wayne State University   \n United States \n  Víctor Braberman    \n ICC (UBA-CONICET)   \n Argentina \n  John Businge    \n University of Nevada, Las Vegas   \n United States \n  Joanna C. S. Santos    \n University of Notre Dame   \n United States \n  Bruno Cafeo    \n University of Campinas (Unicamp)   \n Brazil \n  Haipeng Cai    \n University at Buffalo, SUNY   \n United States \n  Yan Cai    \n Institute of Software at Chinese Academy of Sciences   \n China \n  Jialun Cao    \n Hong Kong University of Science and Technology   \n China \n  Saikat Chakraborty    \n Microsoft Research   \n United States \n  Satish Chandra    \n Google, Inc   \n United States \n  Oscar Chaparro    \n William & Mary   \n United States \n  Preetha Chatterjee    \n Drexel University, USA   \n United States \n  Souti Chattopadhyay    \n University of Southern California   \n United States \n  Chunyang Chen    \n TU Munich   \n Germany \n  Tse-Hsun (Peter) Chen    \n Concordia University   \n Canada \n  Yuting Chen    \n Shanghai Jiao Tong University   \n China \n  Shing-Chi Cheung    \n Hong Kong University of Science and Technology   \n China \n  Anthony Cleve    \n University of Namur   \n Belgium \n  Michael L. Collard    \n The University of Akron   \n United States \n  Maxime Cordy    \n University of Luxembourg, Luxembourg \n  Kostadin Damevski    \n Virginia Commonwealth University   \n United States \n  James C. Davis    \n Purdue University   \n United States \n  Dario Di Nucci    \n University of Salerno \n  Zhen Dong    \n Fudan University   \n China \n  Wensheng Dou    \n Institute of Software Chinese Academy of Sciences   \n China \n  Robert Dyer    \n University of Nebraska-Lincoln   \n United States \n  Davide Falessi    \n University of Rome Tor Vergata, Italy   \n Italy \n  Chunrong Fang    \n Nanjing University   \n China \n  Mattia Fazzini    \n University of Minnesota   \n United States \n  Rudolf Ferenc    \n University of Szeged   \n Hungary \n  Antonio Filieri    \n AWS and Imperial College London   \n United States \n  Michael Foster    \n The University of Sheffield   \n United Kingdom \n  Gordon Fraser    \n University of Passau   \n Germany \n  Alessio Gambi    \n Austrian Institute of Technology (AIT)   \n Austria \n  Cuiyun Gao    \n Harbin Institute of Technology   \n China \n  Zhipeng Gao    \n Shanghai Institute for Advanced Study - Zhejiang University   \n China \n  Joshua Garcia    \n University of California, Irvine   \n United States \n  Paul Gazzillo    \n University of Central Florida   \n United States \n  Ali Ghanbari    \n Auburn University   \n United States \n  Gouri Ginde (Deshpande)    \n University of Calgary   \n Canada \n  Alessandra Gorla    \n IMDEA Software Institute   \n Spain \n  Georgios Gousios    \n Endor Labs & Delft University of Technology   \n Netherlands \n  Lars Grunske    \n Humboldt-Universität zu Berlin   \n Germany \n  Muhammad Ali Gulzar    \n Virginia Tech   \n United States \n  DongGyun Han    \n Royal Holloway, University of London   \n United Kingdom \n  Dan Hao    \n Peking University   \n China \n  Shinpei Hayashi    \n Tokyo Institute of Technology   \n Japan \n  Pinjia He    \n Chinese University of Hong Kong, Shenzhen   \n China \n  Shilin He    \n Microsoft Research   \n China \n  Vincent J. Hellendoorn    \n Carnegie Mellon University   \n United States \n  Xing Hu    \n Zhejiang University   \n China \n  Paola Inverardi    \n Gran Sasso Science Institute   \n Italy \n  Maliheh Izadi    \n Delft University of Technology   \n Netherlands \n  Reyhaneh Jabbarvand    \n University of Illinois at Urbana-Champaign   \n United States \n  Jiajun Jiang    \n Tianjin University   \n China \n  Lingxiao Jiang    \n Singapore Management University   \n Singapore \n  Siyuan Jiang    \n Eastern Michigan University \n  Yu Jiang    \n Tsinghua University   \n China \n  Zhen Ming (Jack) Jiang    \n York University   \n Canada \n  Yasutaka Kamei    \n Kyushu University   \n Japan \n  Maria Kechagia    \n University College London   \n United Kingdom \n  Martin Kellogg    \n New Jersey Institute of Technology   \n United States \n  Foutse Khomh    \n Polytechnique Montréal   \n Canada \n  Sarfraz Khurshid    \n University of Texas at Austin   \n United States \n  Moonzoo Kim    \n KAIST / VPlusLab Inc.   \n South Korea \n  Vladimir Kovalenko    \n JetBrains Research   \n Netherlands \n  Raula Gaikovina Kula    \n Osaka University   \n Japan \n  Christian Kästner    \n Carnegie Mellon University   \n United States \n  Thomas LaToza    \n George Mason University   \n United States \n  Julia Lawall    \n Inria   \n France \n  Claire Le Goues    \n Carnegie Mellon University   \n United States \n  Kevin Leach    \n Vanderbilt University   \n United States \n  Philipp Leitner    \n Chalmers | University of Gothenburg   \n Sweden \n  Dayi Lin    \n Centre for Software Excellence, Huawei Canada   \n Canada \n  Yun Lin    \n Shanghai Jiao Tong University   \n China \n  Mario Linares-Vasquez    \n Universidad de los Andes   \n Colombia \n  Lingfeng Bao    \n Zhejiang University   \n China \n  Hui Liu    \n Beijing Institute of Technology   \n China \n  Ting Liu    \n Xi'an Jiaotong University   \n China \n  Yepang Liu    \n Southern University of Science and Technology   \n China \n  Zhongxin Liu    \n Zhejiang University   \n China \n  David Lo    \n Singapore Management University   \n Singapore \n  Crista Lopes    \n University of California Irvine   \n United States \n  Minghua Ma    \n Microsoft Research   \n United States \n  Lech Madeyski    \n Wroclaw University of Science and Technology   \n Poland \n  Anas \"Nash\" Mahmoud    \n Louisiana State University   \n United States \n  Sam Malek    \n University of California at Irvine   \n United States \n  Jonathan I. Maletic    \n Kent State University \n  Leonardo Mariani    \n University of Milano-Bicocca   \n Italy \n  Antonio Mastropaolo    \n William and Mary, USA   \n United States \n  Collin McMillan    \n University of Notre Dame   \n United States \n  Phil McMinn    \n University of Sheffield   \n United Kingdom \n  Sergey Mechtaev    \n Peking University   \n China \n  Tim Menzies    \n North Carolina State University   \n United States \n  Daniela Micucci    \n University of Milano-Bicocca, Italy   \n Italy \n  Sasa Misailovic    \n University of Illinois at Urbana-Champaign   \n United States \n  Dimitris Mitropoulos    \n University of Athens   \n Greece \n  Emerson Murphy-Hill    \n Google   \n United States \n  André N. Meyer    \n University of Zurich   \n Switzerland \n  Mei Nagappan    \n University of Waterloo   \n Canada \n  Christian D. Newman    \n Rochester Institute of Technology   \n United States \n  Phuong T. Nguyen    \n University of L’Aquila   \n Italy \n  Nan Niu    \n University of Cincinnati   \n United States \n  Nicole Novielli    \n University of Bari   \n Italy \n  Rocco Oliveto    \n University of Molise   \n Italy \n  John-Paul Ore    \n North Carolina State University   \n United States \n  Fabio Palomba    \n University of Salerno   \n Italy \n  Sebastiano Panichella    \n University of Bern   \n Switzerland \n  Liliana Pasquale    \n University College Dublin & Lero   \n Ireland \n  Chao Peng    \n ByteDance   \n China \n  Martin Pinzger    \n Universität Klagenfurt   \n Austria \n  Michael Pradel    \n University of Stuttgart   \n Germany \n  Sebastian Proksch    \n Delft University of Technology   \n Netherlands \n  Rahul Purandare    \n University of Nebraska-Lincoln   \n United States \n  Profir-Petru Pârțachi    \n National Institute of Informatics, Japan   \n Japan \n  Masud Rahman    \n Dalhousie University   \n Canada \n  Baishakhi Ray    \n Columbia University, New York; AWS AI Lab   \n United States \n  Xiaoxue Ren    \n Zhejiang University   \n China \n  Peter Rigby    \n Concordia University; Meta   \n Canada \n  Gregorio Robles    \n Universidad Rey Juan Carlos   \n Spain \n  Daniel Russo    \n Department of Computer Science, Aalborg University   \n Denmark \n  Indranil Saha    \n IIT Kanpur   \n India \n  Hitesh Sajnani    \n The Trade Desk   \n United States \n  Simone Scalabrino    \n University of Molise   \n Italy \n  Giuseppe Scanniello    \n University of Salerno   \n Italy \n  Francisco Servant    \n ITIS Software, University of Malaga   \n Spain \n  Weiyi Shang    \n University of Waterloo   \n Canada \n  Zohreh Sharafi    \n Polytechnique Montréal   \n Canada \n  Bonita Sharif    \n University of Nebraska-Lincoln, USA   \n United States \n  Elena Sherman    \n Boise State University   \n United States \n  August Shi    \n The University of Texas at Austin   \n United States \n  Diomidis Spinellis    \n Athens University of Economics and Business & Delft University of Technology   \n Greece \n  Rodrigo Spinola    \n Virginia Commonwealth University   \n United States \n  Andrea Stocco    \n Technical University of Munich, fortiss   \n Germany \n  Ting Su    \n East China Normal University   \n China \n  Jun Sun    \n Singapore Management University   \n Singapore \n  Xiaobing Sun    \n Yangzhou University   \n China \n  Xiaoyu Sun    \n Australian National University, Australia   \n Australia \n  Tian Tan    \n Nanjing University   \n China \n  Xin Tan    \n Beihang University   \n China \n  Kla Tantithamthavorn    \n Monash University   \n Australia \n  Patanamon Thongtanunam    \n University of Melbourne   \n Australia \n  Thomas Thüm    \n Paderborn University   \n Germany \n  Yuan Tian    \n Queen's University, Kingston, Ontario   \n Canada \n  Christoph Treude    \n Singapore Management University   \n Singapore \n  T.H. Tse    \n The University of Hong Kong, Hong Kong   \n Hong Kong SAR China \n  Michele Tufano    \n Google   \n United States \n  Rosalia Tufano    \n Università della Svizzera Italiana   \n Switzerland \n  Gias Uddin    \n York University, Canada   \n Canada \n  Christopher Vendome    \n Miami University   \n United States \n  Zhiyuan Wan    \n Zhejiang University   \n China \n  Bo Wang    \n Beijing Jiaotong University   \n China \n  Chengpeng Wang    \n Purdue University   \n United States \n  Chong Wang    \n Nanyang Technological University   \n Singapore \n  Haoyu Wang    \n Huazhong University of Science and Technology   \n China \n  Shaowei Wang    \n University of Manitoba   \n Canada \n  Wenwen Wang    \n University of Georgia   \n United States \n  Yanlin Wang    \n Sun Yat-sen University   \n China \n  Ying Wang    \n Northeastern University   \n China \n  Hironori Washizaki    \n Waseda University   \n Japan \n  Shiyi Wei    \n University of Texas at Dallas   \n United States \n  Ming Wen    \n Huazhong University of Science and Technology   \n China \n  Martin White    \n Syneos Health   \n United States \n  Laurie Williams    \n North Carolina State University   \n United States \n  Rongxin Wu    \n Xiamen University   \n China \n  Xin Xia    \n Huawei   \n China \n  Xusheng Xiao    \n Arizona State University   \n United States \n  Tao Xie    \n Peking University   \n China \n  Bowen Xu    \n North Carolina State University   \n United States \n  Chang Xu    \n Nanjing University   \n China \n  Xiwei (Sherry) Xu    \n Data61, CSIRO   \n Australia \n  Jun Yan    \n Institute of Software, Chinese Academy of Sciences   \n China \n  Guowei Yang    \n University of Queensland   \n Australia \n  Jooyong Yi    \n UNIST   \n South Korea \n  Tingting Yu    \n University of Connecticut   \n United States \n  Yijun Yu    \n The Open University, UK   \n United Kingdom \n  Fiorella Zampetti    \n University of Sannio, Italy   \n Italy \n  Juan Zhai    \n University of Massachusetts at Amherst   \n United States \n  Hongyu Zhang    \n Chongqing University   \n China \n  Qian Zhang    \n University of California at Riverside   \n United States \n  Tianyi Zhang    \n Purdue University   \n United States \n  Xiangyu Zhang    \n Purdue University   \n United States \n  Jianjun Zhao    \n Kyushu University   \n Japan \n  Yanjie Zhao    \n Huazhong University of Science and Technology   \n China \n  Hao Zhong    \n Shanghai Jiao Tong University   \n China \n  Andrea Zisman    \n The Open University   \n United Kingdom \n  Ying Zou    \n Queen's University, Kingston, Ontario   \n Canada \n  Zhiqiang Zuo    \n Nanjing University   \n China \n\n x  Sat 14 Dec 01:50    \n\n  FSE 2025   \n  contact form    \n  using conf.researchr.org  ( v1.68.0  )  \n   Support page    \n     \n Tracks  \n How to Submit   \n  Research Papers   \n  Industry Papers   \n  Ideas, Visions and Reflections   \n  Journal First   \n  Student Research Competition   \n  Demonstrations   \n  Posters   \n  Artifacts   \n  Doctoral Symposium   \n  New Faculty Symposium   \n  Software Engineering Education   \n  Tutorials   \n  Student Volunteers   \n  Industry Mentoring Symposium   \n  Workshops   \n  Open Science Policy    \n Workshops  \n 2030 Software Engineering 2025   \n  AI IDE 2025   \n  AI-SDLC 2025   \n  BI4LLMC 2025   \n  CauSE 2025   \n  DevOpsSustain 2025   \n  FaSE4Games 2025   \n  HumanAISE 2025   \n  Intersectionality@FSE 2025   \n  LLMapp 2025   \n  LLanMER 2025   \n  QSE-NE 2025   \n  ResponsibleSE 2025   \n  SWGeno 2025    \n\n Attending  \n Venue: Clarion Hotel Trondheim   \n  Diversity and Inclusion Plan   \n  Code of Conduct",
    "response": "Conference dates: June 23-27, 2025\nLocation: Trondheim, Norway\nType: Offline\nDemonstrations Submission deadline: January 13, 2025\nResearch Papers Initial notification: January 14, 2025\nIndustry Papers Submission deadline: January 15, 2025\nSoftware Engineering Education Submission deadline: January 15, 2025\nIdeas, Visions and Reflections Submission deadline: January 16, 2025\nTutorials Submission deadline: February 3, 2025\nResearch Papers Camera ready (directly accepted paper): February 11, 2025\nStudent Research Competition Submission deadline: February 14, 2025\n2030 Software Engineering Submission Deadline: February 23, 2025\nDoctoral Symposium Submission deadline: February 24, 2025\nResearch Papers Submission for major-revision papers: February 25, 2025\nPosters Submission deadline: February 28, 2025\nTutorials Acceptance: March 3, 2025\nJournal First Submission deadline: March 4, 2025\nDemonstrations Author notification: March 10, 2025\nIdeas, Visions and Reflections Author notification: March 14, 2025\nStudent Research Competition Notification: March 24, 2025\n2030 Software Engineering Acceptance Deadlines: March 25, 2025\nSoftware Engineering Education Author notification: March 25, 2025\nIndustry Papers Author notification: March 25, 2025\nStudent Volunteers Submission deadline: March 30, 2025\nResearch Papers Final notification for major revisions: April 1, 2025\nJournal First Author notification: April 4, 2025\nPosters Acceptance notification: April 10, 2025\nDoctoral Symposium Notification: April 10, 2025\nTutorials Camera-ready deadline: April 14, 2025\nIndustry Papers Camera-ready deadline: April 21, 2025\nSoftware Engineering Education Camera ready: April 21, 2025\nIdeas, Visions and Reflections Camera-ready deadline: April 24, 2025\nPosters Camera-ready deadline: April 24, 2025\nDemonstrations Camera-ready deadline: April 24, 2025\nWorkshops Camera-ready deadline: April 24, 2025\nStudent Research Competition Camera-ready version: April 24, 2025\nResearch Papers Camera ready (major revisions): April 24, 2025\nDoctoral Symposium Camera-ready deadline: April 24, 2025\nStudent Volunteers Notification: April 25, 2025\n2030 Software Engineering Workshop: July 26-27, 2025\n2030 Software Engineering Submission Deadline for the ACM TOSEM special issue: September 30, 2025\n2030 Software Engineering Acceptance Notification of ACM TOSEM papers: October 31, 2025\nResearch Papers Author response: November 22-26, 2024\nWorkshops Notification: November 19, 2024\nWorkshops Workshop proposals submission: October 15, 2024\nResearch Papers Full paper submission: September 12, 2024\nResearch Papers Paper registration: September 5, 2024\nTopics: Software Engineering, Research Papers, Industry Papers, Ideas, Visions, Reflections, Demonstrations, Posters, Artifacts, Doctoral Symposium, New Faculty Symposium, Software Engineering Education, Tutorials, Student Volunteers, Industry Mentoring Symposium, Workshops, Open Science Policy\n\n\n"
  }
]